test-artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 2
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "mix GET + POST"
    flow:
      - get:
          url: "/free"
      - post:
          url: "/echo"
          json:
            test: "artillery"