test-artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30        # test selama 30 detik
      arrivalRate: 5      # 5 user per detik (ringan)
scenarios:
  - name: "Test endpoint bebas"
    flow:
      - get:
          url: "/free"

  - name: "Test root"
    flow:
      - get:
          url: "/"

  - name: "Test greet"
    flow:
      - get:
          url: "/greet?name=Saiful"